In [1]:
import numpy as np
import pandas as pd

In [22]:
np.random.seed(12)

In [51]:
index = [('One', 1), ('One', 2),
         ('Two', 1), ('Two', 2),
         ('Three', 1), ('Three', 2)]
numbers = [11, 111, 22, 222, 33, 333]

ser = pd.Series(numbers, index = index)
index = pd.MultiIndex.from_tuples(index)
num = ser.reindex(index)
num.index.names = ['Words', 'Numbers']
Q1 = num
Q1

Words  Numbers
One    1           11
       2          111
Two    1           22
       2          222
Three  1           33
       2          333
dtype: int64

In [4]:
Q2 = num['Three']
Q2

Numbers
1     33
2    333
dtype: int64

In [5]:
Q3 = num[:, 2]
Q3

Words
One      111
Two      222
Three    333
dtype: int64

In [6]:
Q4 = num.unstack()
Q4

Numbers   1    2
Words
One      11  111
Three    33  333
Two      22  222

In [7]:
Q5 = Q4.sum()
Q5

Numbers
1     66
2    666
dtype: int64

In [8]:
Q6 = pd.DataFrame(np.random.randint(0, 9, size = (6,2)), 
                 index = [[1, 1, 2, 2, 3, 3], ['a', 'b', 'a', 'b', 'a', 'b']],
                 columns = ['A', 'B'])

Q6

     A  B
1 a  6  1
  b  2  3
2 a  3  0
  b  6  1
3 a  4  5
  b  2  6

In [23]:
index = pd.MultiIndex.from_product([['ONE', 'TWO', 'THREE'], ['one','two']], 
                                  names = ['NUMBER', 'number'])
columns = pd.MultiIndex.from_product([['A', 'B'], ['a', 'b', 'c', 'd']],
                                    names = ['LETTER', 'letter'])
randnum = np.random.randint(0, 20, size = (len(index), 8))

In [24]:
Q7 = pd.DataFrame(randnum, index = index, columns = columns)
Q7

LETTER          A               B
letter          a   b   c   d   a   b   c   d
NUMBER number
ONE    one     11   6  17   2   3   3  12  16
       two     17   5  13   2  11  10   0   8
TWO    one     12  13  18   3   4   3   1   0
       two     18  18  16   6  13   9  13  16
THREE  one      0  14  15   1   4   0   4   1
       two     11  12   5  11  19   4  11  11

In [28]:
Q8 = Q7['B']
Q8

letter          a   b   c   d
NUMBER number
ONE    one      3   3  12  16
       two     11  10   0   8
TWO    one      4   3   1   0
       two     13   9  13  16
THREE  one      4   0   4   1
       two     19   4  11  11

In [31]:
ser1 = pd.Series([7, 8, 9, 10], index = ['ONE', 'TWO', 'THREE', 'FOUR'])
ser2 = pd.Series([11, 12, 13, 14], index = ['THREE', 'FOUR', 'FIVE', 'SIX'])
Q9 = pd.concat([ser1, ser2], axis = 1)
Q9

          0     1
ONE     7.0   NaN
TWO     8.0   NaN
THREE   9.0  11.0
FOUR   10.0  12.0
FIVE    NaN  13.0
SIX     NaN  14.0

In [30]:
Q10 = pd.concat([ser1, ser2])
Q10

ONE       7
TWO       8
THREE     9
FOUR     10
THREE    11
FOUR     12
FIVE     13
SIX      14
dtype: int64

In [32]:
Q11 = pd.concat([ser1, ser2], keys = ['A', 'B'])
Q11

A  ONE       7
   TWO       8
   THREE     9
   FOUR     10
B  THREE    11
   FOUR     12
   FIVE     13
   SIX      14
dtype: int64

In [48]:
ser3 = pd.Series([15, 16], index = ['SEVEN', 'EIGHT'])
ser3_df = pd.DataFrame({'B':ser3})
ser3_df

        B
SEVEN  15
EIGHT  16

In [49]:
ser_df = pd.DataFrame({'A':ser1, 'B':ser2})
ser_df

          A     B
FIVE    NaN  13.0
FOUR   10.0  12.0
ONE     7.0   NaN
SIX     NaN  14.0
THREE   9.0  11.0
TWO     8.0   NaN

In [50]:
Q12 = pd.concat([ser_df, ser3_df], sort = False)
Q12

          A     B
FIVE    NaN  13.0
FOUR   10.0  12.0
ONE     7.0   NaN
SIX     NaN  14.0
THREE   9.0  11.0
TWO     8.0   NaN
SEVEN   NaN  15.0
EIGHT   NaN  16.0